{
  "en": "Inglês",
  "pt": "Português",
  "br": "Português",

  "home": "Início",
  "about": "Sobre",
  "projects": "Projetos",
  "tech_stack": "Tecnologias",
  "contact": "Contato",
  "no_error": "Nenhum erro",
  "visit": "Visitar",
  "close": "Fechar",
  "language": "Idioma",
  "navigate_home": "Navegar para o inicio",
  "toggle_menu": "Alternar menu",
  "code": "Código",
  "repository": "Repositório",
  "send": "Enviar",
  "contact_form_success": "Sua mensagem foi enviada com sucesso!",
  "global_error": "Ocorreu um erro ao enviar sua mensagem. Tente novamente mais tarde.",
  "submit_count_error": "Você já enviou 5 mensagens. Aguarde 5 minutos para enviar outra mensagem.",
  "success_icon": "Icone de sucesso",
  "error_icon": "Icone de erro",
  "info_icon": "Icone de informação",
  "warning_icon": "Icone de aviso",
  "inspired_text": "Inspirado por {{name}}",
  "software_engineer": "Engenheiro de Software",
  "about_me": "Sobre mim",
  "yan_main_photo_alt": "Yan Lucas - foto principal",
  "about_image_alt": "Imagem ilustrativa sobre mim",
  "home_section_description_part_1": "Olá, eu sou",
  "home_section_description_part_2": ", um engenheiro de software dedicado com profunda experiência em desenvolvimento web, entregando soluções inovadoras.",
  "about_section_text_part_1": "Engenheiro de software dedicado, residente em {{location}}",
  "about_section_text_part_2": "Tenho {{age}} anos com vasta experiência na criação de interfaces de usuário atraentes e funcionais. Nos últimos {{experience}} anos, trabalhei para várias empresas e tive a oportunidade de contribuir para o desenvolvimento de projetos web emocionantes.",
  "about_section_text_part_3": "Minha força está na criação de experiências web que não apenas atendem às necessidades do usuário, mas também excedem suas expectativas. Estou dedicado à resolução colaborativa de problemas, valorizando perspectivas diversas e buscando ativamente soluções inovadoras. Meu objetivo é aproveitar minha proficiência técnica e habilidades interpessoais para impulsionar projetos de sucesso, garantindo resultados excepcionais para os usuários.",
  "projects_section_text_part_1": "Aqui estão alguns projetos em que trabalhei",
  "projects_section_text_part_2": "Estou sempre em busca de novos desafios e oportunidades para aprender algo novo",
  "tech_stack_section_text_part_1": "Explore minhas tecnologias",
  "tech_stack_section_text_part_2": "Navegue pelas ferramentas e tecnologias que impulsionam minha jornada de desenvolvimento web. Cada ícone representa uma peça do quebra-cabeça, incorporando inovação e eficiência em cada projeto.",
  "contact_form_title": "Entre em contato",
  "contact_form_description": "Estou sempre aberto a novas oportunidades e desafios. Se você quiser entrar em contato, preencha o formulário abaixo e entrarei em contato o mais breve possível.",

  "google_seach": "Pesquisar por {{text}} no Google",

  "spacie_description": "Uma plataforma que conecta empresas a influenciadores para campanhas promocionais. O sistema se integra ao Google, Instagram e TikTok usando o protocolo OAuth2, permitindo aos usuários utilizar suas informações dessas plataformas no Spacie.",
  "spacie_alt": "Imagem da Spacie - Plataforma de marketing de influenciadores",
  "cs_analytics_description": "Este é um site que oferece estatísticas abrangentes, provenientes da HLTV, juntamente com análises personalizadas por administradores para jogadores, times e campeonatos de CS:GO. O usuário pode mergulhar mais fundo no mundo do Counter-Strike: Global Offensive com enormes insights baseados em dados.",
  "cs_analytics_alt": "Imagem do CS Analytics - Plataforma de estatísticas de CS:GO",
  "expert_stats_description": "Uma plataforma dedicada a fornecer estatísticas abrangentes sobre futebol virtual, apresentando quatro ligas. Oferece probabilidades extensas, dados de jogos recentes e estatísticas detalhadas para os próximos jogos, proporcionando uma visão completa do mundo do futebol virtual.",
  "expert_stats_alt": "Imagem do Expert Stats - Plataforma de estatísticas de futebol virtual",
  "chirp_description": "Este é um Twitter exclusivo feito por mim, onde o usuário só pode usar emojis. Serviu como um excelente projeto para aprimorar meus conhecimentos e praticar diversas tecnologias e padrões de design.",
  "chirp_alt": "Imagem do Chirp - Twitter de emojis",
  "massagueirinha_menu_description": "Um site para um cardápio de um restaurante, onde o usuário pode visualizar os pratos e seus preços. Foi um projeto que desenvolvi inicialmente para ser um site de cardápio de um restaurante, mas acabei transformando em um site de cardápio de um restaurante fictício.",
  "massagueirinha_menu_alt": "Imagem da Massagueirinha - Site de cardápio de restaurante",
  "bull_blockchain_description": "Um site para uma empresa de blockchain, onde o usuário pode visualizar as informações da empresa e seus serviços. Foi um projeto que desenvolvi para praticar meus conhecimentos.",
  "bull_blockchain_alt": "Imagem da Bull Blockchain - Site de empresa de blockchain",

  "name_label": "Nome",
  "name_placeholder": "Digite seu nome",
  "email_label": "E-mail",
  "email_placeholder": "Digite seu e-mail",
  "message_label": "Mensagem",
  "message_placeholder": "Digite sua mensagem",

  "required_field_error": "Este campo é obrigatório",
  "name_min_length_error": "O nome deve ter pelo menos 3 caracteres",
  "name_max_length_error": "O nome deve ter no máximo 50 caracteres",
  "email_field_error": "Insira um e-mail válido",
  "message_min_length_error": "A mensagem deve ter pelo menos 5 caracteres",
  "message_max_length_error": "A mensagem deve ter no máximo 1000 caracteres"
}
